// Prisma seed snippet for template aqd-bya-docker
await prisma.documentTemplate.create({
  data: {
    id: 'aqd-bya-docker',
    slug: 'aqd-bya-docker',
    title: 'عقد بيع دراجة نارية',
    locale: "ar-MA",
    isActive: true,
    fields: { create: [
      {
        id: 'aqd-bya-docker_cin',
        fieldName: 'cin',
        fieldLabel: 'ع',
        fieldLabelAr: 'ع',
        isRequired: true,
        fieldType: 'cin',
      },
      {
        id: 'aqd-bya-docker_date',
        fieldName: 'date',
        fieldLabel: 'عقد بيع دراجة نارية بين الموقعين أسفله :الطرف الأولالسيد الحسن لكبيري , المزداد في 1985.09.26 و الحامل للبطاقة الوطنية H444484 الساكن بحي تريفة 01 السعيدية الطرف الثانيالسيد محمد غانم, المزداد في 01/01/1986 و الحامل للبطاقة الوطنية ZG 79874 الساكن بدوار اولاد حمان لعثامنة.قام الطرف الأول ببيع دراجة نارية مستعملة للطرف الثاني  تحمل المعطيات التالية :رقم التسجيل                  : 49 – ا - 33233اسم الصانع            	: DOCKERالنوع                          : XCGLYرقم إطارها الحديدي		: LATXCGLY5G1084209		القوة الجبائية  		: 1عدد الاسطوانات		: 1إن المشتري قد أصبح المسؤول عن الدراجة النارية المذكورة أعلاه ابتداء من تاريخ المصادقة على هذا العقد .الإمضاء:الطرف الأول:                                         الطرف الثاني:',
        fieldLabelAr: 'عقد بيع دراجة نارية بين الموقعين أسفله',
        isRequired: true,
        fieldType: 'date',
      },
      {
        id: 'aqd-bya-docker_signature',
        fieldName: 'signature',
        fieldLabel: 'عقد بيع دراجة نارية بين الموقعين أسفله :الطرف الأولالسيد الحسن لكبيري , المزداد في 1985.09.26 و الحامل للبطاقة الوطنية H444484 الساكن بحي تريفة 01 السعيدية الطرف الثانيالسيد محمد غانم, المزداد في 01/01/1986 و الحامل للبطاقة الوطنية ZG 79874 الساكن بدوار اولاد حمان لعثامنة.قام الطرف الأول ببيع دراجة نارية مستعملة للطرف الثاني  تحمل المعطيات التالية :رقم التسجيل                  : 49 – ا - 33233اسم الصانع            	: DOCKERالنوع                          : XCGLYرقم إطارها الحديدي		: LATXCGLY5G1084209		القوة الجبائية  		: 1عدد الاسطوانات		: 1إن المشتري قد أصبح المسؤول عن الدراجة النارية المذكورة أعلاه ابتداء من تاريخ المصادقة على هذا العقد .الإمضاء:الطرف الأول:                                         الطرف الثاني:',
        fieldLabelAr: 'عقد بيع دراجة نارية بين الموقعين أسفله',
        isRequired: true,
        fieldType: 'signature',
      },
    ] }
  }
});