// Prisma seed snippet for template ashhad
await prisma.documentTemplate.create({
  data: {
    id: 'ashhad',
    slug: 'ashhad',
    title: 'اشهــــــــــــاد',
    locale: "ar-MA",
    isActive: true,
    fields: { create: [
      {
        id: 'ashhad_cin',
        fieldName: 'cin',
        fieldLabel: 'ا',
        fieldLabelAr: 'ا',
        isRequired: true,
        fieldType: 'cin',
      },
      {
        id: 'ashhad_signature',
        fieldName: 'signature',
        fieldLabel: 'اشهــــــــــــاد انا الموقع اسفله : السيد : .............................................................الحامل للبطاقة الوطنية رقم : ....................................................العنوان : .........................................................................بموجب هذا اشهد على نفسي واصرح وانا في كامل قواي العقلية والجسدية انني لا ولن انتمي في اي نقابة في شركة SAIDIA AZUR  حيث اشتغل حاليا .وحرر هذا الاشهاد للادلاء به عند الحاجة والاقتضاء والسلامالامضاء',
        fieldLabelAr: 'اشهــــــــــــاد انا الموقع اسفله',
        isRequired: true,
        fieldType: 'signature',
      },
      {
        id: 'ashhad_address',
        fieldName: 'address',
        fieldLabel: 'اشهــــــــــــاد انا الموقع اسفله : السيد : .............................................................الحامل للبطاقة الوطنية رقم : ....................................................العنوان : .........................................................................بموجب هذا اشهد على نفسي واصرح وانا في كامل قواي العقلية والجسدية انني لا ولن انتمي في اي نقابة في شركة SAIDIA AZUR  حيث اشتغل حاليا .وحرر هذا الاشهاد للادلاء به عند الحاجة والاقتضاء والسلامالامضاء',
        fieldLabelAr: 'اشهــــــــــــاد انا الموقع اسفله',
        isRequired: false,
        fieldType: 'multiline',
      },
    ] }
  }
});